package laba5;


/**
 * Требования:
 * Паттерн команда
 * Ссылка на гит, если хотите issues.
 * Mavel/Gradle
 * */

/**
 * Класс - точка входа в программу.
 * В классе возможна смена используемого менеджера ввода-вывода и менеджера сохранения коллекции в память.
 * @author Homoursus
 * @version 1.0
 */

// TODO: Добавить, проверку на то, является ли файл доступным для записи (для всех файлов)
// TODO: Сделать восстановление сессии через сериализацию модельки, без сохранения и воспроизведения последних команд.
// TODO: Разграничить IOManager и Validator, сделать валидацию модельки при чтении из файла.
// TODO: Придумать как сделать quite вывод нормально.

// TODO: Legacy Code. Надо выкинуть этот файл после дописания 6 лабы.
public class Main {
    public static void main(String[] args) {
    }
}
